Revit 2024 API
UpdaterRegistry.GetRegisteredUpdaterInfos Method
 Returns UpdaterInfos for all the application-wide updaters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static IList<UpdaterInfo> GetRegisteredUpdaterInfos()
Visual Basic
Public Shared Function GetRegisteredUpdaterInfos As IList(Of UpdaterInfo)
Visual C++
public:
static IList<UpdaterInfo^>^ GetRegisteredUpdaterInfos()
Return Value
 List of UpdaterInfo structures
See Also
UpdaterRegistry Class
GetRegisteredUpdaterInfos Overload
Autodesk.Revit.DB Namespace